//=============================================================================
//
// 3Dポリゴンのクラス [Scene3D.h]
// Author : KEITA OHUCHI
//
//=============================================================================
#ifndef _SCENE3D_H_
#define _SCENE3D_H_

#include "Main.h"
#include "Scene.h"


//-----------------------------------------------------------------------------
// クラス定義
//-----------------------------------------------------------------------------
class Scene3D : public Scene {
public:
	//=========================================================================
	// コンストラクタとデストラクタ
	//=========================================================================
	Scene3D(int priority = 0);
	virtual ~Scene3D();

	//=========================================================================
	// 初期化処理
	//=========================================================================
	virtual HRESULT Init() { return S_OK; };
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR2 size, char *texturePath);
	//=========================================================================
	// 更新処理
	//=========================================================================
	virtual void Update();
	//=========================================================================
	// 描画処理
	//=========================================================================
	virtual void Draw();


	void SetRotation(D3DXVECTOR3 rotation) { rotation_ = rotation; }


protected:
	LPDIRECT3DVERTEXBUFFER9	vertexBuffer_;  // 頂点情報格納ワーク
	D3DXMATRIX				worldMatrix_;  // ワールドマトリクス
	D3DXVECTOR3				scale_;  // 大きさ
	D3DXVECTOR3				rotation_;  // 向き
};


#endif


// End of file