//=============================================================================
//
// 2Dアニメーションオブジェクト [SceneAnimation2D.h]
// Author : KEITA OHUCHI
//
//=============================================================================
#ifndef _SCENE_ANIMATION_2D_H_
#define _SCENE_ANIMATION_2D_H_

#include "Main.h"
#include "Scene2D.h"


//-----------------------------------------------------------------------------
// クラス定義
//-----------------------------------------------------------------------------
class SceneAnimation2D : public Scene2D {
public:
	//=========================================================================
	// コンストラクタとデストラクタ
	//=========================================================================
	SceneAnimation2D(int priority = 0);
	virtual ~SceneAnimation2D();

	//=========================================================================
	// 初期化処理
	//=========================================================================
	HRESULT Init() { return S_OK; };
	HRESULT Init(D3DXVECTOR3 pos, float width, float height, D3DXCOLOR color,
				int patternNumU, int patternNumV, int patternOnceFrame, char *textureFilePath);
	//=========================================================================
	// 更新処理
	//=========================================================================
	void Update();
	//=========================================================================
	// 描画処理
	//=========================================================================
	void Draw();
	

private:
	int		patternNumU_;			// パターン数
	int		patternNumV_;			// パターン数
	int		patternOnceFrame_;		// 1パターンの表示フレーム数
	int		animationCounter_;		// カウンタ
};


#endif


// End of file