//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
// ワールド
//
// Created by Ryusei Kajiya on 20151025
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//*****************************************************************************
// 多重インクルード防止
#pragma once

namespace data
{
	//*****************************************************************************
	// 構造体定義
	struct World
	{
	public:
		World() :
			matrix(
			1.f, 0.f, 0.f, 0.f,
			0.f, 1.f, 0.f, 0.f,
			0.f, 0.f, 1.f, 0.f,
			0.f, 0.f, 0.f, 1.f),
			position(0.f, 0.f, 0.f),
			rotation(0.f, 0.f, 0.f),
			scale(1.f, 1.f, 1.f){}

		D3DXMATRIX matrix;
		D3DXVECTOR3 position;
		D3DXVECTOR3 rotation;
		D3DXVECTOR3 scale;
	};
};

