//=============================================================================
//
// サウンド処理[sound.h]
// 製作日 2014 / 9 /  1
// 更新日 2015 / 3 / 18
// Author : 20274	望月 利紀
//
//=============================================================================
#ifndef _SOUND_H_
#define _SOUND_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "Renderer\directx9.h"
#include "XAudio2.h"

//*****************************************************************************
// ライブラリ参照
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// const変数
//*****************************************************************************

//*****************************************************************************
// define定義
//*****************************************************************************

//*****************************************************************************
// 列挙帯定義
//*****************************************************************************
// サウンドファイル
enum SOUND_LABEL
{
	BGM_TEST = 0 ,
	SE_TEST ,
	SOUND_LABEL_MAX 
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************
// パラメータ構造体
struct PARAM
{
	LPCWSTR filename;	// ファイル名
	bool bLoop;			// ループするかどうか
};

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CSound
{
public:
	// コンストラクタ
	CSound();
	// デストラクタ
	~CSound();

	// 初期化
	HRESULT Init( HWND hWnd );
	// 終了
	void	Uninit( void );
	// 再生
	HRESULT Play( SOUND_LABEL label );
	// 停止( ラベル指定 )
	void	Stop( SOUND_LABEL label );
	// 停止( 全部 )
	void	Stop(void);
	// ??
	HRESULT CheckChunk( HANDLE hFile , DWORD format , DWORD *pChunkSize , DWORD *pChunkDataPosition );
	// ??
	HRESULT ReadChunkData( HANDLE hFile , void *pBuffer , DWORD dwBuffersize , DWORD dwBufferoffset );

protected:

private:
	// XAudio2オブジェクトへのインターフェイス
	IXAudio2				*m_pXAudio2;
	// マスターボイス
	IXAudio2MasteringVoice	*m_pMasteringVoice;
	// ソースボイス
	IXAudio2SourceVoice		*m_pSourceVoice[ SOUND_LABEL_MAX ];
	// オーディオデータ
	BYTE					*m_pDataAudio[ SOUND_LABEL_MAX ];
	// オーディオデータサイズ
	DWORD					m_sizeAudio[SOUND_LABEL_MAX];					
};


#endif