//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
// 前移動
//
// Created by Ryusei Kajiya on 20151029
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//*****************************************************************************
// 多重インクルード防止
#pragma once

//*****************************************************************************
// include
#include "Command/command.h"

//*****************************************************************************
// クラス設計
class CommandMoveFront : public Command
{
public:
	CommandMoveFront(){}
	virtual ~CommandMoveFront(){}

	virtual void Execute(PlayerUnit* player);
};