////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////
//// 水しぶきのオブジェクトプール
//// 
//// Created by Ryusei Kajiya on 20151125
////
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
////*****************************************************************************
//// 多重インクルード防止
//#pragma once
//
////*****************************************************************************
//// include
//#include "water_spray.h"
//
////*****************************************************************************
//// 前方宣言
//
////*****************************************************************************
//// クラス設計
//class WaterSprayPool
//{
//public:
//	WaterSprayPool();
//
//	// 作成
//	void Create(
//		const D3DXVECTOR3& position,
//		const D3DXQUATERNION& quaternion);
//	// アニメーション:描画も兼ねてる。
//	void Animate();
//
//private:
//	static const u32 kPoolSize = 10;
//	WaterSpray _particles[kPoolSize];
//	WaterSpray* _first_available;
//};